{"word_to_stem":{},"stem_to_sid":{},"word_to_id":{"":0,"wiki":1,"code":2,"topic":3,"lattice":4,"plugins":5,"packages":6,"repo":7,"users":8,"pat":9,"personal":10,"initialized":11,"2026-05-09":12,"tool":13,"claude":14,"file":15,"maintainer":16,"read":17,"raw":18,"immutable":19,"ingested":20,"sources":21,"owned":22,"lattice-workspace":23,"repo's":24,"source":25,"write":26,"pages":27,"directory":28,"never":29,"edit":30,"through":31,"skill":32,"where":33,"sits":34,"sibling":35,"other":36,"workspace-level":37,"directories":38,"obsidian":39,"opens":40,"workspace":41,"root":42,"sidebar":43,"shows":44,"them":45,"all":46,"together":47,"vault":48,"here":49,"yaml":50,"manifest":51,"md":52,"schema":53,"work":54,"unified":55,"bug":56,"tech-debt":57,"feature":58,"initiative":59,"spike":60,"tracker":61,"knowledge":62,"plugin-managed":63,"stores":64,"own":65,"everything":66,"curated":67,"described":68,"below":69,"when":70,"says":71,"means":72,"containing":73,"paths":74,"written":75,"relative":76,"unless":77,"prefixed":78,"structure":79,"index":80,"content":81,"catalog":82,"update":83,"every":84,"scan":85,"ingest":86,"log":87,"append-only":88,"timeline":89,"apps":90,"conditional":91,"one":92,"folder":93,"per":94,"application":95,"app":96,"overview":97,"category":98,"cross-domain":99,"library":100,"service":101,"pkg":102,"package":103,"domains":104,"areas":105,"across":106,"domain":107,"domain's":108,"concepts":109,"cross-cutting":110,"technical":111,"dependencies":112,"external":113,"libraries":114,"auto-generated":115,"summary":116,"cites":117,"files":118,"architecture":119,"high-level":120,"syntheses":121,"adrs":122,"decision":123,"records":124,"templates":125,"page":126,"reference":127,"only":128,"items":129,"live":130,"wikilinks":131,"like":132,"2026-04-21-flaky-healthkit-tests":133,"frontmatter":134,"required":135,"title":136,"concept":137,"dependency":138,"adr":139,"one-line":140,"tags":141,"tag1":142,"tag2":143,"updated":144,"yyyy-mm-dd":145,"each":146,"has":147,"additional":148,"fields":149,"see":150,"references":151,"page-formats":152,"four":153,"operations":154,"lattice-wiki":155,"run":156,"python":157,"scripts":158,"scan_monorepo":159,"py":160,"json":161,"discovered":162,"automatically":163,"present":164,"diff":165,"user":166,"new":167,"renamed":168,"deleted":169,"wait":170,"confirmation":171,"renames":172,"deletions":173,"create":174,"stub":175,"name":176,"exports":177,"depends_on":178,"depended_on_by":179,"existing":180,"append":181,"entry":182,"path":183,"may":184,"clipped":185,"articles":186,"specs":187,"prs":188,"transcripts":189,"you've":190,"staged":191,"itself":192,"design":193,"docs":194,"surfaced":195,"any":196,"pinned":197,"container":198,"pass":199,"repo-relative":200,"straight":201,"pdf":202,"docx":203,"support":204,"deferred":205,"now":206,"ingest_source":207,"directly":208,"discuss":209,"first":210,"tl":211,"dr":212,"key":213,"claims":214,"which":215,"touched":216,"contradictions":217,"merge":218,"yyyy-mm":219,"slug":220,"in-repo":221,"record":222,"last_sync_commit":223,"last_sync_at":224,"lint":225,"flag":226,"staleness":227,"later":228,"relevant":229,"typically":230,"5-15":231,"represents":232,"propose":233,"contradiction":234,"callouts":235,"noting":236,"10":237,"report":238,"query":239,"question":240,"pick":241,"3-10":242,"categories":243,"full":244,"follow":245,"opportunistically":246,"fall":247,"back":248,"wiki_search":249,"terms":250,"doesn't":251,"cover":252,"synthesize":253,"direct":254,"answer":255,"supporting":256,"detail":257,"inline":258,"code-paths":259,"line":260,"related":261,"section":262,"offer":263,"comparisons":264,"vs-":265,"lint_wiki":266,"mechanical":267,"checks":268,"including":269,"drift":270,"graph_analyzer":271,"structural":272,"stats":273,"semantic":274,"stale":275,"gaps":276,"past":277,"target":278,"date":279,"chain":280,"health":281,"findings":282,"markdown":283,"suggested":284,"actions":285,"iron":286,"rules":287,"truth":288,"disagree":289,"way":290,"around":291,"writes":292,"go":293,"exceptions":294,"touches":295,"changed":296,"claim":297,"either":298,"xxx":299,"foo":300,"src":301,"bar":302,"ts":303,"42":304,"get":305,"flagged":306,"both":307,"good":308,"answers":309,"filed":310,"explorations":311,"compound":312,"format":313,"op":314,"optional":315,"what":316,"valid":317,"ops":318,"delete":319,"note":320,"grep":321,"tail":322,"tools":323,"claude_plugin_root":324,"skills":325,"wherever":326,"plugin":327,"installed":328,"standard":329,"init_vault":330,"bootstrap":331,"detect":332,"emit":333,"prep":334,"metadata":335,"preview":336,"update_index":337,"regenerate":338,"append_log":339,"standardized":340,"bm25":341,"search":342,"fallback":343,"check":344,"code-drift":345,"link":346,"graph":347,"export_marp":348,"render":349,"marp":350,"slide":351,"deck":352,"open":353,"level":354,"show":355,"etc":356,"siblings":357,"useful":358,"view":359,"backlinks":360,"dataview":361,"git":362,"style":363,"concise":364,"generated":365,"prefer":366,"short":367,"paragraphs":368,"bulleted":369,"lists":370,"appropriate":371,"cite":372,"aggressively":373,"you're":374,"sure":375,"say":376,"don't":377,"invent":378,"whenever":379,"touch":380,"layout":381,"start":382,"version":383,"detected_at":384,"repo_root":385,"containers":386,"vault_dir":387,"null":388,"classification":389,"skip":390,"children_count":391,"evals":392,"fixtures":393,"end":394,"adr-0001":395,"sqlite":396,"primary":397,"store":398,"lattice-graph":399,"use":400,"db":401,"two-table":402,"recursive":403,"ctes":404,"traversal":405,"adr_id":406,"0001":407,"status":408,"accepted":409,"decision_date":410,"2026-05-03":411,"deciders":412,"patrick":413,"sprowls":414,"supersedes":415,"superseded_by":416,"code-graph":417,"storage":418,"tokens":419,"1003":420,"context":421,"layer":422,"needs":423,"persistent":424,"graphs":425,"need":426,"databases":427,"intuition":428,"real":429,"survive":430,"contact":431,"cardinality":432,"10k":433,"500k":434,"nodes":435,"access":436,"patterns":437,"point":438,"lookups":439,"bounded":440,"traversals":441,"depth":442,"five":443,"options":444,"weighed":445,"spec":446,"duckdb":447,"kuzudb":448,"neo4j":449,"memgraph":450,"graphml":451,"networkx":452,"canonical":453,"documented":454,"code-graph-schema":455,"database":456,"defaults":457,"handle":458,"queries":459,"constitute":460,"hot":461,"per-language":462,"lives":463,"attrs_json":464,"blobs":465,"keep":466,"core":467,"language-agnostic":468,"consequences":469,"positive":470,"stdlib":471,"second":472,"binary":473,"dep":474,"beyond":475,"tree-sitter":476,"25-year":477,"file-format":478,"stability":479,"guarantees":480,"backwards":481,"compat":482,"survives":483,"upgrades":484,"without":485,"rebuilds":486,"modulo":487,"migrations":488,"sql":489,"universal":490,"language":491,"agent":492,"human":493,"already":494,"knows":495,"cg_query":496,"raw-sql":497,"escape":498,"hatch":499,"much":500,"stronger":501,"v2-tool":502,"incubator":503,"cypher":504,"wal-mode":505,"concurrency":506,"matches":507,"mcp":508,"daemon":509,"shape":510,"many":511,"readers":512,"occasional":513,"configuration":514,"mature":515,"operational":516,"tooling":517,"sqlite3":518,"cli":519,"preinstalled":520,"macos":521,"gui":522,"orms":523,"replication":524,"joins":525,"fine":526,"bad":527,"trope":528,"100m":529,"edge":530,"regimes":531,"negative":532,"native":533,"engine":534,"deeper":535,"hops":536,"complex":537,"pattern":538,"awkward":539,"vs":540,"first-class":541,"vector":542,"type":543,"embedding-based":544,"similarity":545,"edges":546,"land":547,"v2":548,"sqlite-vec":549,"another":550,"more":551,"expressive":552,"specialists":553,"agents":554,"aren't":555,"alternatives":556,"considered":557,"genuine":558,"native-graph":559,"candidate":560,"rejected":561,"v1":562,"churn":563,"years":564,"old":565,"on-disk":566,"breaks":567,"minor":568,"versions":569,"thinner":570,"binding":571,"ecosystem":572,"analytical-first":573,"scan-heavy":574,"workload":575,"point-lookup":576,"bounded-traversal":577,"transactional-shaped":578,"single-process":579,"server":580,"install":581,"jvm":582,"overkill":583,"serialization":584,"loading":585,"deserialize-everything-on-startup":586,"incremental":587,"concurrent":588,"reads":589,"ad-hoc":590,"export":591,"artifact":592,"visualization":593,"triggers":594,"revisit":595,"future-us":596,"move":597,"property-graph":598,"extensions":599,"deepen":600,"routinely":601,"transitive":602,"closure":603,"code-similarity":604,"walks":605,"want":606,"measured":607,"latency":608,"can't":609,"feared":610,"none":611,"true":612,"impact":613,"per-repo-layout":614,"follow-ups":615,"add":616,"cg_export_graphml":617,"snapshot":618,"lands":619,"separate":620,"surface":621,"adr-0002":622,"explicit":623,"hook-surfaced":624,"lifecycle":625,"auto-update":626,"fs":627,"watcher":628,"updates":629,"slash":630,"commands":631,"sessionstart":632,"banner":633,"filesystem":634,"0002":635,"hooks":636,"856":637,"strategy":638,"keeping":639,"current":640,"changes":641,"three":642,"plausible":643,"approaches":644,"session":645,"watch":646,"re-parse":647,"time":648,"make":649,"user-initiated":650,"command":651,"4-update-lifecycle":652,"magic":653,"hook":654,"surfacing":655,"recommendation":656,"initiates":657,"silently":658,"re-parses":659,"behind":660,"user's":661,"concretely":662,"rebuild":663,"dump":664,"mirrors":665,"cg":666,"driven":667,"runs":668,"single":669,"transaction":670,"atomic":671,"last_indexed_commit":672,"against":673,"rev-parse":674,"head":675,"emits":676,"auto-updates":677,"explicit-not-magic-update-lifecycle":678,"retains":679,"agency":680,"long-running":681,"parses":682,"happen":683,"branch":684,"switches":685,"trigger":686,"massive":687,"cascades":688,"failure":689,"modes":690,"visible":691,"sees":692,"fail":693,"act":694,"stays":695,"fs-watching":696,"cross-platform":697,"implement":698,"fsevents":699,"inotify":700,"readdirectorychangesw":701,"ignores":702,"mitigated":703,"cg_status":704,"is_stale":705,"blocking":706,"60":707,"shorter":708,"incrementally":709,"background":710,"consideration":711,"surprise":712,"factor":713,"30":714,"jarring":715,"branch-switch":716,"ambiguity":717,"intent":718,"unclear":719,"handling":720,"leave":721,"unknown":722,"state":723,"burden":724,"fights":725,"wrong":726,"cadence":727,"millisecond-fresh":728,"isn't":729,"needed":730,"process-lifecycle":731,"pain":732,"post-commit":733,"post-merge":734,"couples":735,"plumbing":736,"might":737,"rebuilt":738,"commit":739,"during":740,"long":741,"debugging":742,"ci-built":743,"held":744,"deployment":745,"option":746,"0001-sqlite-primary-store-for-code-graph":747,"last_updated_at":748,"schema_version":749,"rows":750,"auto_update_threshold":751,"config":752,"fewer":753,"commits":754,"kick":755,"off":756,"async":757,"after":758,"uncommitted-changes":759,"indexing":760,"shadow":761,"overlay":762,"committed":763,"adr-0003":764,"observability":765,"category-gate":766,"env":767,"var":768,"opt-out":769,"adopt":770,"lattice_workflows_observability":771,"gate":772,"entire":773,"lattice-workflows":774,"same":775,"fail-open":776,"0003":777,"2026-05-04":778,"env-vars":779,"1011":780,"adding":781,"pretooluse":782,"skill-invocation":783,"logger":784,"appends":785,"lines":786,"tmp":787,"workflows-skill-invocations":788,"foreseeable":789,"include":790,"tool-use":791,"logging":792,"slash-command":793,"similar":794,"disable":795,"deciding":796,"before":797,"ships":798,"because":799,"convention":800,"lock":801,"once":802,"setting":803,"environment":804,"variable":805,"unset":806,"enabled":807,"disabling":808,"values":809,"false":810,"invariant":811,"exits":812,"error":813,"missing":814,"jq":815,"unwritable":816,"malformed":817,"stdin":818,"empty":819,"field":820,"broken":821,"locations":822,"readme":823,"settings":824,"global":825,"local":826,"project":827,"shell":828,"adopter":829,"log-skill-invocation":830,"registered":831,"via":832,"learn":833,"whole":834,"toggle":835,"code-only":836,"change":837,"document":838,"bugs":839,"degrade":840,"breaking":841,"sessions":842,"aligns":843,"lattice_":844,"env-var":845,"naming":846,"lattice-cross-plugin-contract":847,"lattice-naming-convention":848,"coarse":849,"granularity":850,"just":851,"turn":852,"deferring":853,"per-hook":854,"gates":855,"until":856,"logs":857,"accrue":858,"who":859,"semantics":860,"ephemeral":861,"debug-grade":862,"clear":863,"instructions":864,"opt-in":865,"default":866,"enables":867,"disappears":868,"defeating":869,"purpose":870,"data":871,"valuable":872,"small":873,"privacy":874,"cost":875,"vars":876,"lattice_workflows_log_skills":877,"lattice_workflows_log_tools":878,"proliferates":879,"fast":880,"benefit":881,"covering":882,"harder":883,"teach":884,"lattice_workflows_observability_":885,"concrete":886,"appears":887,"shared":888,"cross-plugin":889,"lattice_observability":890,"premature":891,"today":892,"least":893,"future":894,"reuse":895,"lattice-workflows-observability-gate":896,"captures":897,"shipped":898,"registration":899,"surfaces":900,"producing":901,"far":902,"volume":903,"others":904,"adr-0004":905,"filesystem-only":906,"affects":907,"resolution":908,"matched":909,"prefix":910,"graph-aware":911,"0004":912,"2026-05-07":913,"lattice-work":914,"work-items":915,"scope":916,"491":917,"carry":918,"listing":919,"symbols":920,"richest":921,"symbol":922,"names":923,"resolve":924,"allowing":925,"reverse":926,"affect":927,"function":928,"yet":929,"complete":930,"contract":931,"sidecar":932,"work-index":933,"regenerator":934,"makes":935,"symbol-level":936,"matching":937,"package-graph":938,"work-tracker":939,"upgrade":940,"planned":941,"stable":942,"independently":943,"peer":944,"field's":945,"expressivity":946,"limited":947,"must":948,"list":949,"forward-compatible":950,"added":951,"changing":952,"syntax":953,"remain":954,"identifiers":955,"become":956,"form":957,"sidecar's":958,"complexity":959,"caching":960,"schema-version":961,"coupling":962,"adr-0005":963,"sourcetree":964,"sole":965,"model":966,"lattice-source-parser":967,"span-bearing":968,"intermediate":969,"sourcenode":970,"span":971,"object":972,"consumer":973,"outputs":974,"pure":975,"projections":976,"top":977,"subclassing":978,"kind":979,"string":980,"tag":981,"0005":982,"source-tree":983,"domain-model":984,"560":985,"supports":986,"multiple":987,"chunks":988,"embeddings":989,"languages":990,"javascript":991,"typescript":992,"two":993,"shapes":994,"subclass":995,"hierarchies":996,"pythonfunction":997,"typescriptinterface":998,"tree":999,"string-tagged":1000,"kinds":1001,"leaks":1002,"language's":1003,"assumptions":1004,"api":1005,"forces":1006,"variants":1007,"keeps":1008,"flat":1009,"class":1010,"interface":1011,"hierarchy":1012,"attrs":1013,"dicts":1014,"node":1015,"additive":1016,"parsers":1017,"lang":1018,"plus":1019,"extension":1020,"entries":1021,"registry":1022,"surgery":1023,"projection":1024,"unaffected":1025,"consumers":1026,"regardless":1027,"downstream":1028,"upsert":1029,"chunkers":1030,"rag":1031,"indexers":1032,"simple":1033,"nuance":1034,"moves":1035,"dict":1036,"rather":1037,"typed":1038,"attribute":1039,"acceptable":1040,"tradeoff":1041,"have":1042,"rejects":1043,"source-tree-model":1044,"0006-source-parser-sibling-package":1045,"adr-0006":1046,"free":1047,"transport":1048,"concerns":1049,"parser":1050,"depends":1051,"tree-sitter-language-pack":1052,"depend":1053,"standalone":1054,"0006":1055,"distribution":1056,"separation-of-concerns":1057,"596":1058,"original":1059,"called":1060,"tier":1061,"inside":1062,"bundling":1063,"couple":1064,"loader":1065,"potential":1066,"eval":1067,"harnesses":1068,"pip":1069,"seam":1070,"between":1071,"package's":1072,"graphrecords":1073,"plugin's":1074,"reusable":1075,"tree-sitter-backed":1076,"parsing":1077,"boundary":1078,"clean":1079,"separation":1080,"cannot":1081,"leak":1082,"becomes":1083,"thin":1084,"focused":1085,"adapters":1086,"pure-stdlib":1087,"preserved":1088,"takes":1089,"break":1090,"intentional":1091,"confined":1092,"adr-0017":1093,"stdlib-only":1094,"tiers":1095,"codebases":1096,"maintain":1097,"graph-core":1098,"instead":1099,"repays":1100,"lattice-graph-core":1101,"0005-sourcetree-sole-domain-model":1102,"adr-0007":1103,"cli-first":1104,"console-script":1105,"adapter":1106,"slips":1107,"exercised":1108,"testable":1109,"0007":1110,"530":1111,"expose":1112,"some":1113,"above":1114,"building":1115,"risks":1116,"shipping":1117,"underlying":1118,"well":1119,"misshapen":1120,"forced":1121,"tends":1122,"grow":1123,"mcp-specific":1124,"quirks":1125,"rationale":1126,"exercise":1127,"scriptable":1128,"trivially":1129,"ergonomics":1130,"gets":1131,"fixed":1132,"cheaply":1133,"sooner":1134,"descoped":1135,"critical":1136,"implementation":1137,"follows":1138,"mcp-first":1139,"integration":1140,"host":1141,"interim":1142,"cli-shaped":1143,"subcommands":1144,"exit":1145,"codes":1146,"generally":1147,"healthy":1148,"constraint":1149,"require":1150,"reshaping":1151,"arrives":1152,"mcp-native":1153,"idioms":1154,"differ":1155,"0008-single-writer-code-db":1156,"adr-0008":1157,"single-writer":1158,"read-only":1159,"writer":1160,"mode":1161,"enforced":1162,"write-lock":1163,"update_in_progress":1164,"0008":1165,"629":1166,"backing":1167,"processes":1168,"plausibly":1169,"querying":1170,"prefer-graph-over-grep":1171,"tolerates":1172,"multi-reader-single-writer":1173,"callers":1174,"respect":1175,"stray":1176,"corrupt":1177,"stall":1178,"rule":1179,"structurally":1180,"duration":1181,"attempts":1182,"return":1183,"abort":1184,"continue":1185,"uninterrupted":1186,"wal":1187,"block":1188,"trivial":1189,"reason":1190,"most":1191,"mediated":1192,"os-level":1193,"implements":1194,"mutate":1195,"subcommand":1196,"writer-lock":1197,"discipline":1198,"writers":1199,"choose":1200,"retry":1201,"queue":1202,"message":1203,"opened":1204,"write-intent":1205,"flags":1206,"simplifying":1207,"connection":1208,"setup":1209,"operation":1210,"grows":1211,"user-visible":1212,"rare":1213,"pre-announced":1214,"0002-explicit-graph-update-lifecycle":1215,"0007-cli-first-code-graph":1216,"adr-0009":1217,"uv":1218,"ruff":1219,"members":1220,"root-level":1221,"pyproject":1222,"toml":1223,"coordinator":1224,"table":1225,"root-only":1226,"pytest":1227,"test":1228,"runner":1229,"12":1230,"python-version":1231,"0009":1232,"python-tooling":1233,"monorepo":1234,"677":1235,"implemented":1236,"hosts":1237,"currently":1238,"lattice-evals":1239,"expected":1240,"resolver":1241,"poetry":1242,"pdm":1243,"stack":1244,"black":1245,"flake8":1246,"isort":1247,"fragmenting":1248,"ci":1249,"contributor":1250,"onboarding":1251,"developer":1252,"monorepo-friendly":1253,"locks":1254,"resolves":1255,"cross-package":1256,"deps":1257,"natively":1258,"acts":1259,"declares":1260,"publishable":1261,"configured":1262,"per-package":1263,"allowed":1264,"invocation":1265,"dev":1266,"installs":1267,"coherent":1268,"ruff's":1269,"uniform":1270,"overrides":1271,"audit":1272,"contributors":1273,"onboard":1274,"sync":1275,"working":1276,"md's":1277,"prescription":1278,"consistent":1279,"prior":1280,"runners":1281,"take":1282,"packaging":1283,"story":1284,"conventions":1285,"migrating":1286,"requires":1287,"removing":1288,"lockfiles":1289,"configs":1290,"migration":1291,"one-time":1292,"tracked":1293,"adr-0010":1294,"lattice-curator":1295,"fifth":1296,"lattice-":1297,"curates":1298,"task-specific":1299,"briefs":1300,"expert":1301,"userpromptsubmit":1302,"split":1303,"precedent":1304,"0010":1305,"plugin-topology":1306,"1565":1307,"promoted":1308,"warning":1309,"superseded":1310,"built":1311,"adr-0025":1312,"0012-python-bedrock-stack-for-curator":1313,"began":1314,"lattice-curator-core":1315,"langchain-aws":1316,"langgraph":1317,"pydantic":1318,"placement":1319,"posture":1320,"recorded":1321,"reports":1322,"recurring":1323,"operates":1324,"bloat":1325,"retrieval":1326,"pulls":1327,"narrative":1328,"broad":1329,"wikilink":1330,"fan-out":1331,"2026-05-07-scenarios-v1-no-wiki":1332,"runset":1333,"improved":1334,"several":1335,"scenarios":1336,"entirely":1337,"evidence":1338,"injected":1339,"irrelevant":1340,"specific":1341,"task":1342,"lattice-experts":1343,"compiles":1344,"role-tagged":1345,"filters":1346,"loads":1347,"unrelated":1348,"actual":1349,"prompt":1350,"layered":1351,"always":1352,"invoke":1353,"workflow":1354,"starts":1355,"implementing":1356,"writing-plans":1357,"system":1358,"fires":1359,"miss":1360,"cases":1361,"help":1362,"curation":1363,"ship":1364,"package-vs-plugin":1365,"uses":1366,"curator":1367,"logic":1368,"given":1369,"transcripttail":1370,"stage":1371,"returns":1372,"brief":1373,"no-op":1374,"awareness":1375,"unit-testable":1376,"isolation":1377,"owns":1378,"piece":1379,"outside":1380,"claude's":1381,"loop":1382,"catches":1383,"turns":1384,"lastskill":1385,"lastskillat":1386,"cache":1387,"giving":1388,"recent":1389,"signal":1390,"falls":1391,"keyword":1392,"heuristics":1393,"bottleneck":1394,"bails":1395,"jsonl":1396,"fire-log":1397,"hard":1398,"minutebudgetseconds":1399,"cap":1400,"lattice_curator_disable":1401,"provide":1402,"safety":1403,"hatches":1404,"receives":1405,"meaningful":1406,"cooperation":1407,"reliance":1408,"remembering":1409,"right":1410,"experts":1411,"high-recall":1412,"relevance":1413,"filtered":1414,"hand-tuned":1415,"compilation":1416,"pure-package":1417,"curator-":1418,"spinning":1419,"fetch":1420,"provides":1421,"know":1422,"wants":1423,"ask":1424,"going":1425,"area":1426,"blocks":1427,"bedrock":1428,"budget":1429,"3s":1430,"non-trivial":1431,"careful":1432,"gating":1433,"reach":1434,"adds":1435,"per-repo":1436,"per-project":1437,"overlaps":1438,"mission":1439,"eventual":1440,"deprecation":1441,"rewire":1442,"explicitly":1443,"fix":1444,"place":1445,"filtering":1446,"selective":1447,"smaller":1448,"trades":1449,"discoverability":1450,"read-time":1451,"filter":1452,"sidesteps":1453,"fire":1454,"misses":1455,"matter":1456,"skipping":1457,"invoked":1458,"motivation":1459,"operate":1460,"self-direct":1461,"mcp-only":1462,"relies":1463,"call":1464,"exactly":1465,"behavior":1466,"alongside":1467,"bundle":1468,"consumes":1469,"creates":1470,"asymmetric":1471,"equal":1472,"peers":1473,"subject":1474,"side":1475,"consumed":1476,"skills'":1477,"tracks":1478,"gains":1479,"scenario":1480,"family":1481,"id":1482,"benchmark":1483,"haiku":1484,"deepseek":1485,"kimi-class":1486,"pin":1487,"plan-writing":1488,"consider":1489,"telemetry":1490,"effectiveness":1491,"overlap":1492,"exists":1493,"adr-0011":1494,"consolidate":1495,"machine":1496,"superseding":1497,"two-root":1498,"0011":1499,"845":1500,"earlier":1501,"prescribed":1502,"distinct":1503,"roots":1504,"human-visible":1505,"machine-regenerable":1506,"clearly":1507,"trees":1508,"default_workspace_name":1509,"placing":1510,"alternative":1511,"though":1512,"objection":1513,"addressed":1514,"subdirectory":1515,"gitignored":1516,"sub-paths":1517,"visibility":1518,"features":1519,"tech":1520,"debt":1521,"lattice_workspace":1522,"override":1523,"derived":1524,"remember":1525,"ecosystem-owned":1526,"area's":1527,"still":1528,"how":1529,"set":1530,"documentation":1531,"links":1532,"dotfile":1533,"non-dot":1534,"slightly":1535,"unconventional":1536,"restore":1537,"single-root":1538,"reverting":1539,"constant":1540,"workspace-root":1541,"reflects":1542,"adr-0012":1543,"langchain":1544,"build":1545,"client":1546,"pipeline":1547,"orchestration":1548,"structured":1549,"output":1550,"0012":1551,"745":1552,"proposed":1553,"team":1554,"reconsidered":1555,"light":1556,"0009-uv-ruff-python-tooling":1557,"maturity":1558,"following":1559,"concern":1560,"choice":1561,"hatchling":1562,"asyncio_mode":1563,"auto":1564,"llm":1565,"chatbedrockconverse":1566,"langchain-core":1567,"stategraph":1568,"models":1569,"with_structured_output":1570,"python-frontmatter":1571,"path-dep":1572,"run-hook":1573,"cmd":1574,"bash":1575,"shim":1576,"fastmcp":1577,"toolchain":1578,"retrieve":1579,"accepts":1580,"argument":1581,"injection":1582,"identical":1583,"counterparts":1584,"equally":1585,"robust":1586,"zod":1587,"schema-validated":1588,"responses":1589,"indirection":1590,"replaces":1591,"gray-matter":1592,"different":1593,"capable":1594,"bridges":1595,"code's":1596,"adr-0013":1597,"brainstorming":1598,"plans":1599,"relocate":1600,"plan":1601,"filenames":1602,"inferred":1603,"cwd":1604,"affected":1605,"hard-fails":1606,"writing":1607,"0013":1608,"workflows":1609,"1392":1610,"wrote":1611,"inconsistent":1612,"resolved":1613,"problems":1614,"scattered":1615,"artifacts":1616,"physically":1617,"distant":1618,"describe":1619,"traces":1620,"generic":1621,"yyyy-mm-dd-":1622,"carried":1623,"indication":1624,"targeted":1625,"hurting":1626,"browseability":1627,"silent":1628,"non-lattice":1629,"landed":1630,"freshly":1631,"created":1632,"surrounding":1633,"absent":1634,"file-work-item":1635,"had":1636,"adopted":1637,"workspace-resolution-via-cli":1638,"last":1639,"holdouts":1640,"feature-name":1641,"co-located":1642,"tasks":1643,"falling":1644,"workspace-resolution":1645,"doc":1646,"hard-fail":1647,"exist":1648,"verbatim":1649,"pointing":1650,"init":1651,"stop":1652,"creation":1653,"inference":1654,"path-based":1655,"condition":1656,"dir":1657,"recognisable":1658,"repos":1659,"custom":1660,"lattice-directory":1661,"sensible":1662,"umbrella":1663,"next":1664,"describes":1665,"browsable":1666,"filename":1667,"prefixes":1668,"glance":1669,"errors":1670,"upfront":1671,"dead":1672,"haven't":1673,"subprocess-not-import":1674,"eliminating":1675,"inconsistency":1676,"pre-existing":1677,"migrated":1678,"teams":1679,"hand":1680,"accept":1681,"dual-tree":1682,"transition":1683,"tests":1684,"seed":1685,"fixture":1686,"uplift":1687,"workspace-sibling":1688,"pair":1689,"asymmetry":1690,"lattice-workflows-consumption-seam":1691,"maintains":1692,"silent-fallback":1693,"motivated":1694,"fold":1695,"namespace":1696,"indexed":1697,"linted":1698,"ownership":1699,"subtree":1700,"underneath":1701,"extra":1702,"nesting":1703,"buys":1704,"nothing":1705,"widely":1706,"understood":1707,"better":1708,"workflow-side":1709,"violate":1710,"consumer-of-vault":1711,"principle":1712,"env-var-and-subprocess":1713,"discovery":1714,"2026-05-plans-specs-path-redesign":1715,"originating":1716,"adr-0014":1717,"per-plugin":1718,"tracking":1719,"bump":1720,"installed_version":1721,"applied_version":1722,"warn_if_stale":1723,"pending_updates":1724,"coerce":1725,"lazily":1726,"pyyaml":1727,"runtime":1728,"foundational":1729,"0014":1730,"versioning":1731,"1944":1732,"str":1733,"ought":1734,"absorb":1735,"template":1736,"restructured":1737,"sections":1738,"re-run":1739,"manually":1740,"unconditionally":1741,"pending":1742,"scans":1743,"minimal":1744,"leaving":1745,"follow-up":1746,"2026-05-per-plugin-version-tracking-in-lattice-yaml":1747,"v0":1748,"bumps":1749,"top-level":1750,"idempotent":1751,"bool":1752,"there":1753,"whose":1754,"differs":1755,"untouched":1756,"pendingupdate":1757,"excludes":1758,"v1-coerced":1759,"lazy":1760,"backward":1761,"compatibility":1762,"step":1763,"promotes":1764,"memory":1765,"disk":1766,"rewritten":1767,"coercion":1768,"alone":1769,"rewrite":1770,"happens":1771,"mutation":1772,"occurs":1773,"hand-rolled":1774,"flat-yaml":1775,"safe_load":1776,"safe_dump":1777,"sort_keys":1778,"default_flow_style":1779,"diffs":1780,"integrate":1781,"seams":1782,"print":1783,"plugin-owned":1784,"flow":1785,"plugin-specific":1786,"version__":1787,"atomically":1788,"copy":1789,"signals":1790,"auto-applies":1791,"anything":1792,"lattice-wiki-core":1793,"version_check":1794,"migrate":1795,"stay":1796,"banners":1797,"orchestrator":1798,"workspaces":1799,"produce":1800,"spurious":1801,"in-memory":1802,"lets":1803,"noticed":1804,"available":1805,"separately":1806,"successfully":1807,"applied":1808,"detection":1809,"strictly":1810,"informative":1811,"manifests":1812,"carries":1813,"in-tree":1814,"sites":1815,"known":1816,"loudly":1817,"typeerror":1818,"miscount":1819,"surprising":1820,"read-style":1821,"worse":1822,"longer":1823,"bottom":1824,"reader":1825,"supported":1826,"indefinitely":1827,"25":1828,"nobody":1829,"forever":1830,"jumps":1831,"look":1832,"reviewers":1833,"cause":1834,"per-workspace":1835,"cadences":1836,"fresh":1837,"enough":1838,"unit":1839,"eager":1840,"tool's":1841,"dirty":1842,"preserves":1843,"non-mutating":1844,"hand-roll":1845,"dict-list":1846,"too":1847,"nested":1848,"threshold":1849,"hand-rolling":1850,"cheaper":1851,"maintenance":1852,"bigger":1853,"record_install":1854,"collapses":1855,"goes":1856,"away":1857,"part":1858,"enable":1859,"public":1860,"fully":1861,"manifest-schema":1862,"example":1863,"extended":1864,"version-tracking":1865,"banner-not-auto-apply":1866,"aggregates":1867,"aggregate":1868,"analogue":1869,"enhancement":1870,"info":1871,"auto-rendered":1872,"name-only":1873,"adr-0015":1874,"workspace-root-relative":1875,"bare":1876,"forbidden":1877,"0015":1878,"1519":1879,"0011-single-workspace-root":1880,"places":1881,"used":1882,"non-canonical":1883,"forms":1884,"relative-to-current-page":1885,"escapes":1886,"0011-":1887,"found":1888,"22":1889,"91":1890,"symptoms":1891,"mismatch":1892,"2026-05-09-fix-vault-rooted-wikilinks":1893,"2026-05-09-adjust-linter-for-work-sibling-to-vault":1894,"linter":1895,"respectively":1896,"captured":1897,"2026-05-workspace-relative-wikilinks-linter-and-content-rewrite":1898,"item":1899,"shorthand":1900,"stem":1901,"linter's":1902,"stems":1903,"aliased":1904,"display":1905,"text":1906,"alias":1907,"companion":1908,"enforcement":1909,"keys":1910,"workspace-relative":1911,"wiki-internal":1912,"obsidian's":1913,"panel":1914,"correctly":1915,"produces":1916,"tide":1917,"false-positive":1918,"broken-link":1919,"targets":1920,"deprecated":1921,"regression":1922,"guard":1923,"reintroduction":1924,"reachable":1925,"one-shot":1926,"two-pass":1927,"regex":1928,"specified":1929,"lint-report":1930,"unambiguous":1931,"authors":1932,"lead":1933,"patch":1934,"obsidian-side":1935,"forked":1936,"gives":1937,"standards-compliant":1938,"re-hide":1939,"jump-to":1940,"undoing":1941,"value":1942,"single-workspace-root":1943,"auto-rewrite":1944,"masking":1945,"authoring":1946,"lint-as-broken-link":1947,"approach":1948,"violations":1949,"per-page":1950,"is_work":1951,"duplicate":1952,"titles":1953,"workspace-walking":1954,"exempt":1955,"orphan":1956,"lattice-vault-terminology":1957,"vault-terminology":1958,"reflect":1959,"workspace-root-as-vault":1960,"walking":1961,"validate":1962,"landing":1963,"confirm":1964,"zero":1965,"results":1966,"check-canonical-form":1967,"recurs":1968,"adr-0016":1969,"track":1970,"pcvelz":1971,"superpowers":1972,"obra":1973,"upstream":1974,"fork's":1975,"claude-code-native":1976,"substrate":1977,"taskcreate":1978,"taskupdate":1979,"tasklist":1980,"blockedby":1981,"cross-session":1982,"resume":1983,"plan-mode":1984,"hard-gate":1985,"pre-commit":1986,"stop-deflection":1987,"worth":1988,"cross-cli":1989,"portability":1990,"loss":1991,"worktree-detection":1992,"merge-back":1993,"0016":1994,"2026-05-10":1995,"fork":1996,"claude-code":1997,"task-management":1998,"1963":1999,"descended":2000,"engineering-discipline":2001,"framework":2002,"upstreams":2003,"diverge":2004,"substantively":2005,"cosmetically":2006,"superpowers-fork-vs-upstream":2007,"lineage":2008,"diagram":2009,"comparison":2010,"rubric":2011,"consequential":2012,"inherits":2013,"flows":2014,"codex":2015,"gemini":2016,"opencode":2017,"markdown-checklist":2018,"based":2019,"worktree":2020,"release-notes":2021,"todowrite":2022,"cc":2023,"16":2024,"persists":2025,"embeds":2026,"fence":2027,"descriptions":2028,"hard-gates":2029,"enterplanmode":2030,"exitplanmode":2031,"swapping":2032,"askuserquestion":2033,"handoff":2034,"pre-commit-check-tasks":2035,"sh":2036,"stop-deflection-guard":2037,"code-reviewer":2038,"subagent":2039,"superpowers-extended-cc":2040,"removes":2041,"side-by-side":2042,"trade-off":2043,"2026-05-superpower-fork-selection":2044,"license":2045,"preserve":2046,"attribution":2047,"mit":2048,"requirements":2049,"ongoing":2050,"task-substrate":2051,"evolution":2052,"task-tracking":2053,"lattice's":2054,"cross-references":2055,"implicitly":2056,"claude-code-only":2057,"goal":2058,"completes":2059,"vibes-based":2060,"closes":2061,"ahead":2062,"mid-plan":2063,"reading":2064,"re-parsing":2065,"guardrail":2066,"avoids":2067,"footgun":2068,"disables":2069,"save":2070,"mid-flow":2071,"while":2072,"in_progress":2073,"fresh-session":2074,"deflections":2075,"50":2076,"parse":2077,"transcript":2078,"defensively":2079,"aligned":2080,"rest":2081,"curator's":2082,"stage-tracker":2083,"mjs":2084,"workspace-aware":2085,"assume":2086,"anyone":2087,"running":2088,"hits":2089,"wall":2090,"simply":2091,"paper":2092,"modified":2093,"substantially":2094,"diverged":2095,"main":2096,"using-git-worktrees":2097,"directory-name":2098,"heuristic":2099,"worktrees":2100,"upstream's":2101,"git-dir":2102,"git-common-dir":2103,"misidentifies":2104,"warrant":2105,"non-":2106,"adopts":2107,"removed":2108,"rely":2109,"brittle":2110,"channel":2111,"embedded":2112,"edits":2113,"description":2114,"preserving":2115,"lose":2116,"materially":2117,"improve":2118,"reliability":2119,"re-merges":2120,"periodically":2121,"re-applies":2122,"cc-native":2123,"patches":2124,"replicates":2125,"let":2126,"load":2127,"pull":2128,"genuinely":2129,"identity":2130,"made":2131,"rests":2132,"reopen":2133,"hold":2134,"exposes":2135,"richer":2136,"taskget":2137,"parameter":2138,"obsolete":2139,"metadata-channel":2140,"hack":2141,"obra-vs-pcvelz":2142,"delta":2143,"narrows":2144,"management":2145,"scoped":2146,"reasons":2147,"re-evaluate":2148,"audience":2149,"rethink":2150,"stops":2151,"merging":2152,"drifts":2153,"even":2154,"directionally":2155,"bites":2156,"mis-detecting":2157,"contribute":2158,"upstream-of-lattice":2159,"locally":2160,"stalls":2161,"releases":2162,"ai":2163,"lattice-wiki-agent":2164,"aws":2165,"569":2166,"ai-powered":2167,"using":2168,"components":2169,"component":2170,"role":2171,"multi-step":2172,"match":2173,"capability":2174,"module":2175,"model-injection":2176,"inject":2177,"hitting":2178,"invokes":2179,"process":2180,"declared":2181,"headless":2182,"dispatched":2183,"auto-memory":2184,"keyed":2185,"git-worktree":2186,"interacts":2187,"oauth":2188,"1244":2189,"claude_config_dir":2190,"projects":2191,"encoded-project-key":2192,"contains":2193,"individually-named":2194,"feedback_":2195,"user_":2196,"project_":2197,"reference_":2198,"instructs":2199,"sharing":2200,"preferences":2201,"corrections":2202,"repeatable":2203,"evaluation":2204,"persistence":2205,"interactive":2206,"project-key":2207,"segment":2208,"encoded":2209,"separators":2210,"replaced":2211,"empirically":2212,"verified":2213,"2026-05-06":2214,"launch":2215,"memory_paths":2216,"private":2217,"cc-mem-flag-dnvt":2218,"private-tmp-cc-mem-flag-dnvt":2219,"cc-cp-nx6b":2220,"rsync":2221,"mono-repo":2222,"private-tmp-cc-cp-nx6b-repo":2223,"cc-wt-vm96":2224,"wt":2225,"users-pat-personal-mono-repo":2226,"third":2227,"row":2228,"trap":2229,"linkage":2230,"re-keys":2231,"parent":2232,"repository's":2233,"shares":2234,"harness":2235,"regular":2236,"gitdir":2237,"pointer":2238,"since":2239,"there's":2240,"documents":2241,"side-effect":2242,"anthropic_api_key":2243,"auth":2244,"keychain":2245,"max-subscription":2246,"authenticates":2247,"undocumented-but-working":2248,"knobs":2249,"mechanism":2250,"effect":2251,"event":2252,"claude_code_disable_auto_memory":2253,"apikeysource":2254,"automemoryenabled":2255,"confirmed":2256,"guide":2257,"cleanest":2258,"fit":2259,"subprocess":2260,"implications":2261,"lattice_evals":2262,"add_worktree":2263,"materialize":2264,"per-run":2265,"scenario's":2266,"baseline_sha":2267,"combined":2268,"fresh-tmp":2269,"cfg":2270,"isolates":2271,"harness's":2272,"smoke":2273,"left":2274,"saved":2275,"cfg_dir":2276,"proactively":2277,"errored":2278,"runner_headless":2279,"2026-05-06-lattice-evals-worktree-does-not-isolate-auto-memory":2280,"belt-and-suspenders":2281,"no-session-persistence":2282,"skips":2283,"stream-json":2284,"stdout":2285,"redundant":2286,"2026-05-06-lattice-evals-oauth-token-as-api-key-rejected":2287,"2026-05-05-lattice-evals-credentials-in-isolated-config-dir":2288,"credentials-isolation":2289,"analysis":2290,"partially":2291,"prompt-caching":2292,"server-side":2293,"behavioral":2294,"points":2295,"events":2296,"enforce":2297,"side-effects":2298,"modifying":2299,"642":2300,"register":2301,"optionally":2302,"injects":2303,"begins":2304,"active":2305,"stage-aware":2306,"retriever":2307,"top-scoring":2308,"session's":2309,"submits":2310,"allows":2311,"augment":2312,"hints":2313,"executes":2314,"inspect":2315,"calls":2316,"invalid":2317,"plugin_root":2318,"session-start":2319,"prompt-submit":2320,"pre-tool-use":2321,"receive":2322,"non-zero":2323,"warnings":2324,"tradeoffs":2325,"pro":2326,"con":2327,"modification":2328,"synchronously":2329,"slow":2330,"delay":2331,"compose":2332,"cleanly":2333,"registers":2334,"ordering":2335,"non-deterministic":2336,"unstructured":2337,"heaviest":2338,"named":2339,"common":2340,"envelopes":2341,"limits":2342,"library-boundary":2343,"mirror":2344,"1859":2345,"2026-05-lattice-graph-plugin-design":2346,"stabilizes":2347,"trims":2348,"describe-type":2349,"imported-by":2350,"exported-by":2351,"listed":2352,"definition":2353,"share":2354,"cg_find":2355,"definitions":2356,"cg_callers":2357,"method":2358,"depth-bounded":2359,"code-comprehension":2360,"cg_callees":2361,"cg_imports":2362,"imports":2363,"cg_imported_by":2364,"cg_exports":2365,"uncapped":2366,"digest":2367,"public-api":2368,"sweeps":2369,"refactoring":2370,"cg_exported_by":2371,"publicly":2372,"exported":2373,"re-export":2374,"what's":2375,"import":2376,"cg_describe_package":2377,"counts":2378,"citation":2379,"verification":2380,"cg_describe_type":2381,"methods":2382,"parents":2383,"data-model":2384,"cg_describe_path":2385,"contained":2386,"freshness":2387,"relying":2388,"humans":2389,"3-mcp-tools-surface":2390,"34-49":2391,"principles":2392,"questions":2393,"else":2394,"pairs":2395,"cg_describe_":2396,"per-edge-direction":2397,"direction-as-arg":2398,"pattern-match":2399,"describe_":2400,"suitable":2401,"list-returning":2402,"truncated":2403,"limit_used":2404,"int":2405,"arrays":2406,"ro":2407,"disambiguation":2408,"returning":2409,"erroring":2410,"22-30":2411,"limit":2412,"100":2413,"ceiling":2414,"1000":2415,"timeout":2416,"not_found":2417,"ambiguous":2418,"invalid_arg":2419,"query_timeout":2420,"query_too_complex":2421,"read_only_violation":2422,"exact":2423,"name_pattern":2424,"glob":2425,"re":2426,"enum":2427,"disambiguator":2428,"supplied":2429,"qualifiers":2430,"find":2431,"callees":2432,"describe-package":2433,"describe-path":2434,"multi-line":2435,"pretty":2436,"tty-detected":2437,"tty":2438,"success":2439,"args":2440,"violation":2441,"unreadable":2442,"lib":2443,"init__":2444,"describe_package":2445,"implementations":2446,"argparse":2447,"replacements":2448,"plugin-deployment-shapes":2449,"splits":2450,"2026-05-architecture-3":2451,"12-tool":2452,"gotchas":2453,"exception":2454,"single-record":2455,"per-tool":2456,"candidates":2457,"promotion":2458,"streaming":2459,"cross-file":2460,"type-shape":2461,"2026-05-11":2462,"1057":2463,"tables":2464,"integer":2465,"kind-specific":2466,"signature":2467,"idx_nodes_kind_name":2468,"idx_nodes_path":2469,"dst":2470,"idx_edges_dst_kind":2471,"idx_edges_src_kind":2472,"last_indexed_at":2473,"languages_indexed":2474,"wiki_page":2475,"column":2476,"2026-05-lattice-graph-core-documents-edge":2477,"columns":2478,"indexes":2479,"force":2480,"reuses":2481,"digests":2482,"cte":2483,"select":2484,"function'":2485,"foo'":2486,"calls'":2487,"union":2488,"join":2489,"min":2490,"group":2491,"type_params":2492,"expecting":2493,"cheap":2494,"capture":2495,"history":2496,"last-indexed":2497,"mechanically":2498,"produced":2499,"producer":2500,"owner":2501,"fidelity":2502,"treats":2503,"to_graph_records":2504,"maps":2505,"onto":2506,"tuples":2507,"allocated":2508,"allocation":2509,"transactions":2510,"scanning":2511,"decisions":2512,"maintained":2513,"layers":2514,"code-as-source-of-truth":2515,"governed":2516,"knowledge-management":2517,"1424":2518,"base":2519,"source-code":2520,"evolves":2521,"obeys":2522,"material":2523,"accretes":2524,"facts":2525,"frontmatter-on-every-page":2526,"content-oriented":2527,"code-truth":2528,"raw-immutable":2529,"every-write-goes-to-vault":2530,"every-claim-cites":2531,"such":2532,"moment":2533,"choices":2534,"code-as-truth":2535,"edited":2536,"accrete":2537,"contributions":2538,"requiring":2539,"authoritative":2540,"sitting":2541,"configurable":2542,"repo-root":2543,"wiki's":2544,"perspective":2545,"co-evolved":2546,"folders":2547,"category-specific":2548,"schemas":2549,"endpoints":2550,"data-models":2551,"enforces":2552,"page-format":2553,"close":2554,"walk":2555,"drill":2556,"citations":2557,"orphans":2558,"gap":2559,"minimum":2560,"accurate":2561,"defined":2562,"forbids":2563,"drop":2564,"self-correcting":2565,"dispatch":2566,"ingestor":2567,"librarian":2568,"scanner":2569,"migrator":2570,"0004-work-tracker-as-consumer-plugin":2571,"wiki-cites-graph-not-duplicates":2572,"derivable":2573,"queried":2574,"duplicated":2575,"lattice-page-body-table-conventions":2576,"body-table":2577,"grammar":2578,"glossary":2579,"load-bearing":2580,"2026-05-lattice-ecosystem-review":2581,"review":2582,"diagnoses":2583,"live-vault":2584,"prescribes":2585,"topology":2586,"direction":2587,"problem":2588,"self-host":2589,"graph-derived":2590,"summaries":2591,"wired":2592,"single-package":2593,"classifications":2594,"pluggable":2595,"packs":2596,"1223":2597,"two-pass-context-curation":2598,"catalogentry":2599,"wiki'":2600,"experts'":2601,"absolute":2602,"readonly":2603,"promise":2604,"navigable":2605,"excluded":2606,"they're":2607,"pickable":2608,"demand":2609,"selects":2610,"comes":2611,"breadth":2612,"collapsed":2613,"pack":2614,"neither":2615,"hardcoding":2616,"layouts":2617,"inverts":2618,"input":2619,"lattice-vault":2620,"pass1pick":2621,"deduped":2622,"buildcatalog":2623,"fans":2624,"awaits":2625,"merges":2626,"dedupes":2627,"merged":2628,"knowing":2629,"came":2630,"except":2631,"provenance":2632,"dirs":2633,"500":2634,"introduces":2635,"invalidation":2636,"malformed-frontmatter":2637,"skipped":2638,"logged":2639,"continues":2640,"poison":2641,"outcome":2642,"empty_catalog'":2643,"jsonc":2644,"vaultdir":2645,"rulesdir":2646,"toggles":2647,"whole-source":2648,"finer-grained":2649,"react-native":2650,"handled":2651,"picks":2652,"dumb":2653,"defines":2654,"types":2655,"slot":2656,"broader":2657,"consume":2658,"narrow":2659,"interfaces":2660,"honors":2661,"2026-05-context-curation-agent-design":2662,"guarantee":2663,"includes":2664,"project's":2665,"occasionally":2666,"notes":2667,"admits":2668,"ever":2669,"expands":2670,"third-party":2671,"extensible":2672,"execution":2673,"executing-plans":2674,"subagent-driven-development":2675,"dispatching-parallel-agents":2676,"easy":2677,"confuse":2678,"executing":2679,"separate-session":2680,"same-session-with-quality-gates":2681,"orthogonal":2682,"independent":2683,"decision-tree":2684,"1064":2685,"execute":2686,"units":2687,"superficially":2688,"single-agent":2689,"sequential":2690,"resumed-session":2691,"restores":2692,"sdd":2693,"same-session":2694,"implementer":2695,"spec-compliance":2696,"reviewer":2697,"code-quality":2698,"serially":2699,"isolated":2700,"previous":2701,"failing":2702,"subsystems":2703,"plan-driven":2704,"parallel":2705,"picking":2706,"wastes":2707,"fails":2708,"quality":2709,"tells":2710,"subagents":2711,"continuity":2712,"whether":2713,"plan-execution":2714,"applies":2715,"mostly":2716,"resumed":2717,"self-verification":2718,"post-integration":2719,"conflict":2720,"high":2721,"failures":2722,"bullets":2723,"execution-skill":2724,"selection":2725,"subagent-vs-teammate":2726,"distinguishes":2727,"off-main":2728,"mechanisms":2729,"agent-team":2730,"teammates":2731,"drive":2732,"2026-05-execution-skills-comparison":2733,"synthesizes":2734,"internally":2735,"exploratory":2736,"sub-tasks":2737,"within":2738,"substitutes":2739,"solve":2740,"scales":2741,"distinction":2742,"starting":2743,"applicable":2744,"recommends":2745,"treat":2746,"resuming":2747,"experimental":2748,"incubating":2749,"behavior-shaping":2750,"project-scoped":2751,"iteration":2752,"promoting":2753,"auto-discover":2754,"refresh":2755,"1314":2756,"homes":2757,"plugin-scoped":2758,"namespaced":2759,"bare-named":2760,"iterate":2761,"promote":2762,"auto-discovered":2763,"plugin-manifest":2764,"freely":2765,"affecting":2766,"plugin-level":2767,"baseline":2768,"validated":2769,"ready":2770,"author":2771,"graduates":2772,"pressure":2773,"wiring":2774,"final":2775,"making":2776,"works":2777,"author's":2778,"doing":2779,"skill's":2780,"effort":2781,"user-scoped":2782,"friction":2783,"half-baked":2784,"sweet":2785,"spot":2786,"project-local":2787,"overhead":2788,"focus":2789,"body":2790,"red":2791,"auxiliary":2792,"tightening":2793,"helps":2794,"verify":2795,"sense":2796,"rigor":2797,"user-facing":2798,"tuned":2799,"red-green":2800,"writing-skills":2801,"incubation":2802,"often":2803,"namespacing":2804,"dispatches":2805,"supplies":2806,"knowledge_skills":2807,"fully-qualified":2808,"launching-plan-teams":2809,"born":2810,"2026-05-03-enable-agent-teams":2811,"2026-05-04-promote-launching-plan-teams":2812,"that's":2813,"commitment":2814,"knowledge-skills-pattern":2815,"bare-name-first":2816,"0007-bare-name-first-skill-resolution":2817,"policy":2818,"why":2819,"speed":2820,"matters":2821,"agent-teams":2822,"involve":2823,"roles":2824,"prompts":2825,"amplifies":2826,"appear":2827,"available-skills":2828,"mid-session":2829,"wasn't":2830,"fired":2831,"auto-discovery":2832,"collides":2833,"care":2834,"committing":2835,"probably":2836,"checked":2837,"avoid":2838,"user-private":2839,"assumes":2840,"helper":2841,"plugin-namespaced":2842,"possible":2843,"phase":2844,"automated":2845,"checklist":2846,"steps":2847,"routine":2848,"promote-skill":2849,"filing":2850,"explicit-not-magic":2851,"extends":2852,"release":2853,"1965":2854,"newer":2855,"waits":2856,"auto-running":2857,"30-second":2858,"something":2859,"thousands":2860,"visiting":2861,"leaves":2862,"manual":2863,"linux":2864,"windows":2865,"rebases":2866,"stashes":2867,"semantically":2868,"commit-fresh":2869,"watching":2870,"thing":2871,"monitor":2872,"restart":2873,"debug":2874,"it's":2875,"serves":2876,"first-time":2877,"corrupted":2878,"unreachable":2879,"algorithm":2880,"name-status":2881,"replace":2882,"delete-old":2883,"add-new":2884,"iso":2885,"sentinel":2886,"pointed":2887,"graph-stale-threshold":2888,"days":2889,"startup":2890,"single-transaction":2891,"pre-update":2892,"single-row":2893,"serving":2894,"governs":2895,"introduced":2896,"re-runs":2897,"re-templates":2898,"re-touches":2899,"apply":2900,"rewrites":2901,"partial-state":2902,"half-finished":2903,"auto-applied":2904,"banner-then-explicit-init":2905,"printed":2906,"subsequent":2907,"end-to-end":2908,"sets":2909,"passively":2910,"action":2911,"plugin-versioning-and-update-mechanism":2912,"case":2913,"auto-apply":2914,"version-recording":2915,"analog":2916,"upgrade-time":2917,"complement":2918,"0014-per-plugin-version-tracking-in-lattice-yaml":2919,"2026-05-lattice-release-wiki-sync":2920,"workflow-level":2921,"instance":2922,"refuses":2923,"rebasing":2924,"warning-and-continuing":2925,"ensuring":2926,"state_gate":2927,"precondition":2928,"kicks":2929,"higher":2930,"languageparser":2931,"abstraction":2932,"self-contained":2933,"1747":2934,"extraction":2935,"cross-module":2936,"file-extension":2937,"parser-agnostic":2938,"abc":2939,"typescript'":2940,"javascript'":2941,"python'":2942,"file_extensions":2943,"ts'":2944,"tsx'":2945,"tree_sitter":2946,"abstractmethod":2947,"def":2948,"self":2949,"file_path":2950,"bytes":2951,"parseresult":2952,"ast":2953,"helpers":2954,"override-able":2955,"detect_language_specific_imports":2956,"iterable":2957,"importedge":2958,"extract_signature":2959,"function_node":2960,"5-language-support":2961,"39-57":2962,"handles":2963,"batching":2964,"typescriptparser":2965,"javascriptparser":2966,"pythonparser":2967,"ext":2968,"tsx":2969,"tree-sitter-typescript":2970,"js":2971,"jsx":2972,"cjs":2973,"tree-sitter-javascript":2974,"tree-sitter-python":2975,"rust":2976,"java":2977,"kotlin":2978,"swift":2979,"speculative":2980,"post-v1":2981,"end_line":2982,"end_column":2983,"start_column":2984,"is_exported":2985,"per-kind":2986,"otherwise":2987,"96-152":2988,"best-effort":2989,"name-resolution":2990,"imported":2991,"bar'":2992,"receiver":2993,"statically":2994,"declarable":2995,"chains":2996,"capped":2997,"import-renames":2998,"dynamic":2999,"protocols":3000,"import__":3001,"getattr":3002,"property":3003,"obj":3004,"methodname":3005,"decorator":3006,"metaprogramming":3007,"ambient":3008,"declarations":3009,"declare":3010,"late":3011,"overshoot":3012,"quick":3013,"additivity":3014,"decide":3015,"same-module":3016,"leans":3017,"pre-compiled":3018,"wheels":3019,"pip-installable":3020,"unmaintained":3021,"dylib":3022,"dll":3023,"platform":3024,"already-known-feasible":3025,"exercises":3026,"corresponding":3027,"unittest":3028,"discover":3029,"materializes":3030,"code-graph-mcp-surface":3031,"strategies":3032,"config-driven":3033,"languageconfig":3034,"c-family":3035,"scala":3036,"walker":3037,"outliers":3038,"diverges":3039,"tortured":3040,"python's":3041,"all__":3042,"earn":3043,"internal":3044,"lifted":3045,"research":3046,"graphify-extraction":3047,"2026-05-lattice-source-parser-design":3048,"tolerant":3049,"partial":3050,"offending":3051,"spans":3052,"file_node":3053,"parse_errors'":3054,"react":3055,"graphify's":3056,"defining":3057,"2026-05-lattice-source-parser-readme":3058,"confirms":3059,"custom-walk":3060,"lean":3061,"classes":3062,"parse-time":3063,"multi-node":3064,"aliases":3065,"gracefully":3066,"json-to-stdout":3067,"exit-code":3068,"optionality":3069,"matrix":3070,"contracts":3071,"gitignore":3072,"2394":3073,"govern":3074,"other's":3075,"discoverable":3076,"executed":3077,"hard-dep":3078,"beside":3079,"shelling":3080,"prints":3081,"assert":3082,